import numpy as np

# створення масиву з списку
# a = np.array([1, 2, 3])
# print(a)

# 2d список
# a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
# print(a)

# створення масиву з діапазону
# a = np.arange(0, 1000, 2)
# print(a)

# створення масиву з діапазону з плаваючою точкою
# a = np.arange(0, 100, 0.1)
# print(a)

# діапазон  розділений на 5 рівних частин
# a = np.linspace(0, 10, 7)
# print(a)

# створення масиву з нулями
# a = np.zeros((10, 10))
# print(a)

# створення масиву з конкретним значенням
# a = np.full((10, 10), 0)
# print(a)
# print(a.shape) # розмірність масиву
# print(a.dtype) # тип даних в масиві
# print(a.ndim) # кількість вимірів в масиві
# print(a.size) # кількість елементів в масиві

# a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
# print(a)
# print(a[0]) # перший рядок
# print(a[0][0]) # перший елемент першого рядка
# print(a[0, 0]) # перший елемент першого рядка
# print(a[0:2, 0:2]) # перші два рядки та перші два стовпці
# print(a[:, 1]) # перші два рядки та другий стовпець

# a = np.array([1, 2, 3])
# b = np.array([4, 5, 6])

# print(a + b) # поелементне додавання
# print(a - b) # поелементне віднімання
# print(a * b) # поелементне множення
# print(a / b) # поелементне ділення

# a = np.array([1, 2, 3])
# print(a.sum()) # сума елементів масиву
# print(a.mean()) # середнє значення елементів масиву
# print(a.min()) # мінімальне значення елементів масиву
# print(a.max()) # максимальне значення елементів масиву

# транспонування масиву
# a = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
# print(a)
# print(a.T)

# a = np.random.rand(10) # створення масиву з випадковими числами від 0 до 1
# print(a)

a = np.random.randint(0, 10, (10, 10)) # створення масиву з випадковими цілими числами від 0 до 100 розміром 10x10
print(a)